import { Outlet} from "react-router-dom";
import React from 'react'
import Header from "./components/Header.jsx";
import Footer from "./components/Footer.jsx";
import { ProductContext } from "./context.jsx";
import { useState, useEffect } from "react";

function App() {
    const [tea, setPuer] = useState([{
      "src": "/img/product/tea/YunNan.jpeg",
      "name": "Шу Yun Nan Qi Zi Bing Cha 2005 рік 357г",
      "description": "Шу Yun Nan Qi Zi Bing Cha 2005 рік вагою - справжня розкіш для шанувальників чаю. ",
      "description2": "Смак - поєднання глибини, багатства і гармонії. Ви будете насолоджуватися насиченими нотками сухофруктів, горіхів і шоколаду, які прекрасно збалансовані.",
      "description3": "Ви відчуєте ароматні нотки ванілі, квітів і землі, що створюють атмосферу спокою і насолоди.",
      "description4": "Цей чай вибір справжніх цінителів, вишуканості і неперевершеності смаку. Цей доставить вам задоволення від кожного ковтка, й подарує вам незабутні відчуття, які стануть частиною вашого чайного досвіду.",
      "price": "200 грн.",
      "id": "1",
      "count": "7"
     },
     {
      "src": "/img/product/tea/Shu-ZhongCha-gold.jpeg",
      "name": "Шу Пуер від Zhong Cha",
      "description": "Шу Пуер від бренду Zhong Cha - вишуканий і неперевершений чай, який зачаровує своїм багатством смаків і ароматів. Чай виробляється з великої уваги до деталей та використанням високоякісного сирого чайного листя.",
      "description2": "Кожна Шу Пуер від Zhong Cha - це шедевр чайної майстерності.",
      "description3": "Цей чай підійде для особистого задоволення, розкішного чаювання в колі друзів або як подарунок для справжнього цінителя чаю. Розкрийте свої смакові рецептори з Шу Пуер від Zhong Cha і насолоджуйтеся унікальними моментами чайної насолоди.",
      "price": "1999 грн.",
      "id": "2",
      "count": "13"
     },
     {
      "src": "/img/product/tea/Shu-ZhongCha.jpeg",
      "name": "Shu Zhong Cha",
      "description": "\"Жовта Печатка\" від відомого бренду Zhong Cha, врожай 2005 року - справжня перлина серед чаїв. Цей чай виробляється з використанням найкращих чайних листків, які були зібрані в 2005 році і збережені з уважністю, щоб досягти досконалості смаку та аромату.",
      "description2": "Володіє вишуканим ароматом, що переплітається з нотками зрілих фруктів і землистої свіжості.",
      "description3": "Кожна чашка переносить вас в глибину століть чайної культури. Завдяки процесу післяферментації, цей чай має глибокий, насичений колір, що свідчить про його відмінну якість та витончений смаковий букет.",
      "description4": "Цей чай - справжній скарб для колекціонерів і цінителів Шу Пуер. \"Жовта Печатка\" 2005 року - це елітний чай, який має виразну історичну цінність і є прикладом вишуканості в світі чаю. Розкрийте смакові грані цього шедевру від Zhong Cha",
      "price": "1999 грн.",
      "id": "3",
      "count": "10"
     },
     {
      "src": "/img/product/tea/Shu-LaoTongZhi.jpeg",
      "name": "Шу Lao Tong Zhi 2004 рік 357г",
      "description": "Шу пуер Lao tong Zhi - вироблений у 2004 році, особливий, і його вік додає йому глибини та складності смаку. Чай вироблений зі спеціально відібраної сировини і витриманий з  найкращих традицій чайного виробництва.",
      "description2": "Смак насичений і глибокий. Ви будете насолоджуватися нотками сухофруктів, деревини та шоколаду, які переплітаються на вашому язиці.",
      "description3": "Аромат захоплює своєю інтенсивністю та багатством. Ви відчуєте нотки ванілі, карамелі та прянощів, які створюють чарівну атмосферу і залишають незабутні враження.",
      "description4": "Lao tong Zhi - вибір справжнього знавця чаю, який цінує історію, якість і витончений смак.",
      "price": "1999 грн.",
      "id": "4",
      "count": "7"
     },
     {
      "src": "/img/product/tea/Shu-good-lowCoast.jpg",
      "name": "Шу Kunming Hechangxuan \"Ба Нянь Чен Юнь\" 357г",
      "description": "\"Ба Нянь Чэн Юнь\" втілює в собі глибоку історію та витончену майстерність. Походить від відомої компанії Kunming Hechangxuan Tea Industry, яка славиться своїми високоякісними продуктами. ",
      "description2": "Має глибокий і насичений смак, збалансований між нотками сухофруктів, деревини і легкою терпкістю, які захоплють ваші рецептори.",
      "description3": "Аромат - це поєднання свіжих та приємних трав'яних нот, які створюють невимушену і релаксуючу атмосферу.",
      "description4": "\"Ба Нянь Чен Юнь\" - це вибір справжніх цінителів чаю.",
      "price": "1999 грн.",
      "id": "5",
      "count": "9"
     },
     {
      "src": "/img/product/tea/Shu-elit-BangZhang.jpeg",
      "name": "Elit Bang Zhang",
      "description": "Елітний Шу Пуер з регіону Сишуаньбанна, з місцевості Bang Zhang, виготовлений з високоякісного добірного сировини з врожаю 2005 року, є справжнім скарбом серед чайних експертів і цінителів.",
      "description2": "Цей Шу Пуер відзначається своєю вишуканою якістю та багатством смаків.",
      "description3": "Його смак поєднує нотки сухофруктів, деревини, земляних тонів. Кожен ковток підносить вас до нового рівня смакових вражень.",
      "description4": "",
      "price": "1999 грн.",
      "id": "6",
      "count": "2"
     },
     {
      "src": "/img/product/tea/Shu-Dvorcov3.jpg",
      "name": "Шу Дворцовий 357г",
      "description": "\"Дворцовий\" Шу Пуер виробляється з вибірних листків чайного дерева, зібраних зі старих і зрілих чайних плантацій.",
      "description2": "Аромат виразний і витончений. Він поєднує в собі нотки землі, лісових трав і сухофруктів, створюючи неповторний букет ароматів.",
      "description3": "Смак багатогранний і насичений. Він починається з ніжного солодкуватого присмаку, плавно переходячи до глибоких тонах сухофруктів і прянощів.",
      "description4": "Цей чай володіє особливим характером і витонченим смаком, які допоможуть вам насолодитися найвищими чайними якостями.",
      "price": "1999 грн.",
      "id": "7",
      "count": "17"
     },
     {
      "src": "/img/product/tea/Shu-classic-Yunnani2.jpeg",
      "name": "Шу Пуер Nan Nou Shan 2008 року млинець 357г",
      "description": "Шу Пуер \"Nan Nou Shan\" вироблений у 2008 році - це видатний чай, що привертає увагу своєю вишуканістю та якістю. Цей чай отримав свою назву від гірського району Nan Nou Shan, де зростають вибрані чайні дерева.",
      "description2": "Виразний смак його розкривається шар за шаром. Починаючи з деревно-земляних тонів, чай розвивається в нюансовану смакову палітру зі смаженими зернами, сухими фруктами та легкими квітковими нотками.",
      "description3": "Цей Шу Пуер є справжнім шедевром, який вартує бути в колекції кожного цінителя чаю. Він відображає майстерність і традиції чайного виробництва.",
      "price": "1999 грн.",
      "id": "8",
      "count": "7"
     }])
    const [dishes, setDishes] = useState([])
    const [changeProduct, setChangeProduct] = useState(true)
    const [productId, setProductId] = useState(1)

    const getPuer = async () => {
      try{
        const response = await fetch (
          'https://647f25e6c246f166da903167.mockapi.io/tea'
        ).then((response) => response.json())
    
        setPuer(response)
        localStorage.setItem('tea', JSON.stringify(response))
      }
      catch{

      }
      }
    
    const getDishes = async () => {
      try{
        const response2 = await fetch (
            'https://647f25e6c246f166da903167.mockapi.io/dishes'
          ).then((response2) => response2.json())
      
          setDishes(response2)
      } 
      catch{

      } 
      }
    
    useEffect(() => {
        getPuer()
        getDishes()
        window.scrollTo(0, 0)
      }, [])
    
    
    // console.log(window.location.pathname)
    return(
        <>
            <ProductContext.Provider value={{tea, dishes, changeProduct, setChangeProduct, productId, setProductId}}>    
          <Header/>
                <Outlet/>
          <Footer/>
            </ProductContext.Provider>
        </>
    )
}

export default App