import { useState, useEffect } from 'react'
import Header from './Header'
import Footer from './Footer'
import { NavLink } from 'react-router-dom'

function ArticlesAbout2() {
  
  return (
    <>
    <section className='articles-about-section'>
        <div className="articles-about__container">
          <div className="articles-img-block">
            <img src="../img/about2_shen_full.jpg" alt="Puer"/>
            <div className="articles-title">
              <h1>Про Шен</h1>
            </div>
          </div>
            <div className="articles-about-block">
                <div className="about-left">
                    <h1>Історія Шен Пуера</h1>
                    <p>Історія створення чаю Шен Пуер сягає давніх часів і пов'язана з найвідомішим регіоном Юньнань в Китаї, де знаходяться гірські райони, ідеальні для вирощування чайної рослини Camellia sinensis, за своїм кліматом і грунтом.</p>
                    <h2>Що таке Шен?</h2>
                    <b>Це прорес натурального старіння</b>
                    <p>Шу Пуер пов'язан з Шен Пуером. Шен Пуер відомий своїм натуральним процесом старіння, який відбувається протягом декількох десятиліть. Однак, в пошуках способу прискорити процес старіння і зробити пуер більш доступним, було створено Шу Пуер.</p>
                    <p>Протягом багатьох століть виробництво було в основному пов'язане з виробленням Шен Пуеру. Його процес виробництва включав збирання свіжих листків чаю, їх швидку обробку і витримку для натурального старіння. Цей процес займав багато часу, але результатом був особливий сорт чаю з унікальним смаком, ароматом і властивостями.</p>
                    <h1>Плюси Шу</h1>
                    <p>Натуральне старіння: </p>
                    <p>Одна з найбільш визначних особливостей Шен Пуеру - це його здатність до старіння. Чайні листки витримуються протягом тривалого періоду часу, що дозволяє їм розвиватися, змінюватися і набувати нових властивостей з плином часу. Це надає чаю багатогранний смак, глибокий аромат і комплексні нотки.</p>
                    <p>Смак і аромат: </p>
                    <p>Смак глибоким і складний. Він може мати нотки сухофруктів, деревини, меду, прянощів і навіть земли. Аромат відрізняється насиченим профілем. В ньому можна відчути нотки квітів, стиглих фруктів, пряних трав і деревини.</p>
                    
                    <p>Властивості:</p>
                    <ul className="info-block-1">
                        <li>Корисні властивості для організму</li>
                        <li>Містить поліфеноли, амінокислоти та інші корисні речовини</li>
                        <li>має антиоксидантні, протизапальні і протигрибкові властивості</li>
                        <li>Сприяє підвищенню імунітету</li>
                        <li>Покращює шлунково-кишковий тракт та загальне самопочуття</li>
                    </ul>
                    <h1>Висновки</h1>
                    <p>Шен Пуер доступний у різних сортах, збірках і року врожаю, що робить його дуже привабливим для любителів чаю. Ви можете вибрати чай залежно від вашого смаку, бажаної стиглості листків, регіону походження і інших особливостей.</p>
                    <p>Завдяки цим особливостям і властивостям, Шен Пуер вважається дуже цінним і цікавим чаєм. Він має вишуканий смак, аромат і здатність старіти, що робить його вигідним вибором для шанувальників чаю, колекціонерів і тих, хто бажає насолоджуватися унікальним чайним досвідом.</p>
                    <div className="end-info">Не зволікайте. Cпробуйте Шен Пуер, щоб насолодитися його багатством <br></br>і відчути унікальну магію цього чудового чаю.</div>
                    <div className="article-href">
                      <h3>Сторінки:</h3>
                      <p>Каталог Шен</p>
                      <p>,</p>
                      <p>Чай чорний Шен</p>
                      <p>,</p>
                      <p>Шен Пуер</p>
                      <p>,</p>
                      <p>Про Шен</p>
                    </div>
                    <div className="article-tag">
                      <h3>Теги:</h3>
                      <p>Шен</p>
                      <p>,</p>
                      <p>Чай чорний Шен</p>
                      <p>,</p>
                      <p>Шен Пуер</p>
                      <p>,</p>
                      <p>Про Шен</p>
                      <p>,</p>
                      <p>Історія Шен</p>
                    
                    
                    </div>
                    
                </div>
            
                <div className="about-right">
                    <div>Ще більше</div>
                </div>
            </div>
        </div>
    </section>
    </>
  )
}

export default ArticlesAbout2
