import { useState, useEffect } from 'react'
import Header from './Header'
import Footer from './Footer'
import { NavLink } from 'react-router-dom'

function ArticlesAbout1() {

  return (
    <>
    <section className='articles-about-section'>
        <div className="articles-about__container">
          <div className="articles-img-block">
            <img src="../img/about3_cup_full.jpg" alt="Puer"/>
            <div className="articles-title">
              <h1>Про Шу</h1>
            </div>
          </div>
            <div className="articles-about-block">
                <div className="about-left">
                    <h1>Історія Шу Пуера</h1>
                    <p>Шу Пуер має довгу історію, яка сягає сотень років назад. Він виник в провінції Юньнань в Китаї, де знаходиться один з найвідоміших регіонів для виробництва пуеру. Там чайові дерева, відомі як "Camellia sinensis var. assamica", ростуть у гірських районах, де клімат і грунти створюють найбільш сприятливі умови для їх росту.</p>
                    <h2>Що таке Шу?</h2>
                    <b>Це прискорений процес старіння чаю.</b>
                    <p>Шу Пуер пов'язан з Шен Пуером. Шен Пуер відомий своїм натуральним процесом старіння, який відбувається протягом декількох десятиліть. Однак, в пошуках способу прискорити процес старіння і зробити пуер більш доступним, було створено Шу Пуер.</p>
                    <p>У 1973 році в провінції Юньнань завдяки спеціальному обробленню сирих листків чаю та процесу ферментації, <b>у продовж декількох років</b>, досягається зрілості, змінює хімічний склад і набуває особливі смакові властивості Шу Пуеру.</p>
                    <h1>Плюси Шу</h1>
                    <p>Смак і аромат: </p>
                    <p>Його багатий смак і аромат викликають справжню насолоду для шанувальників чаю.  Він має багатство смакових нот, які включають нотки деревини, карамелі, шоколаду, сухофруктів і прянощів.</p>
                    <p>Властивості:</p>
                    <ul className="info-block-1">
                        <li>Має лікувальними властивості</li>
                        <li>Знижує рівень холестерину</li>
                        <li>Підтримує здоров'я серця і кровоносної системи</li>
                        <li>Покращує травлення і допомагає в боротьбі зі стресом</li>
                        <li>Має благотворний вплив на шкіру і загальний стан організму</li>
                    </ul>
                    <h1>Висновки</h1>
                    <p>Шу Пуер - це витончений чай з багатою історією, унікальними особливостями і неперевершеним смаком. Він надає можливість насолоджуватися вишуканим напоєм і відчувати його лікувальні властивості.</p>
                    <p>Купівля Шу Пуер - це інвестиція в якість і задоволення, яке можна отримати від цього прекрасного чаю.</p>
                    <div className="end-info">Не зволікайте. Cпробуйте Шу Пуер, щоб насолодитися його багатством <br></br>і відчути унікальну магію цього чудового чаю.</div>
                    <div className="article-href">
                      <h3>Сторінки:</h3>
                      <p>Каталог Шу</p>
                      <p>,</p>
                      <p>Чай чорний Шу</p>
                      <p>,</p>
                      <p>Шу Пуер</p>
                      <p>,</p>
                      <p>Про Шу</p>
                    </div>
                    <div className="article-tag">
                      <h3>Теги:</h3>
                      <p>Шу</p>
                      <p>,</p>
                      <p>Чай чорний Шу</p>
                      <p>,</p>
                      <p>Шу Пуер</p>
                      <p>,</p>
                      <p>Про Шу</p>
                      <p>,</p>
                      <p>Історія Шу</p>
                    
                    
                    </div>
                    
                </div>
            
                <div className="about-right">
                    <div>Ще більше</div>
                    <div className="about-right-block">
                      <a href="catalog/tea">Каталог</a>
                    </div>
                </div>
            </div>
        </div>
    </section>
    </>
  )
}

export default ArticlesAbout1
